{
  "epic_name": "nip17-timestamp-lookback",
  "created_at": "2026-02-10T22:30:00Z",
  "updated_at": "2026-02-10T22:47:44Z",
  "total_stories": 3,
  "stories": [
    {
      "id": "01",
      "name": "subscription-lookback-window",
      "title": "Implement kind-specific subscription lookback window for NIP-17",
      "description": "Modify the `startSubscription` method in `src/main/nostling/service.ts` to apply a 3-day lookback window for kind 1059 (NIP-17 gift wraps) instead of the default 24-hour window. This accounts for NIP-17's timestamp randomization specification (up to 2 days in the past) plus a 1-day safety margin. Kind 4 and other event types continue using the existing 24-hour `FIRST_STREAM_LOOKBACK`. The implementation adds a constant `NIP17_TIMESTAMP_WINDOW = 3 * 24 * 60 * 60` and conditionally applies it based on the event kind in the `filtersWithSince` mapping logic (around line 1421-1432).",
      "acceptance_criteria": [
        "AC-001",
        "AC-002",
        "AC-003"
      ],
      "scope": {
        "includes": [
          "Add NIP17_TIMESTAMP_WINDOW constant (3 days)",
          "Modify startSubscription to conditionally apply lookback based on kind",
          "Apply 3-day window for kind 1059",
          "Preserve 24h window for all other kinds (especially kind 4)",
          "Update both initial subscription and timestamp-based resumption logic"
        ],
        "excludes": [
          "Polling mechanism changes",
          "UI changes",
          "Database schema changes",
          "Changes to other event processing logic"
        ]
      },
      "complexity": "medium",
      "mock_dependencies": [],
      "introduces_mocks": [],
      "test_fixtures": [],
      "status": "done",
      "notes": "This story addresses the root cause directly. Can be tested independently by verifying subscription filters include correct `since` timestamps. Verification via dual-instance test showing messages with timestamps >24h in past are now received."
    },
    {
      "id": "02",
      "name": "polling-kind1059-enhancement",
      "title": "Extend polling mechanism to include kind 1059",
      "description": "Enhance the `pollMessages` method in `src/main/nostling/service.ts` to include kind 1059 gift wraps in addition to existing kind 4 polling. This provides a defense-in-depth redundant delivery path for NIP-17 messages. The implementation involves creating a `getKind1059Filters` method (similar to `getKind4Filters` at line 819-822) that returns filters for kind 1059 events, then including these filters alongside kind 4 filters in the polling query within `pollMessages` (around line 1017-1102). This ensures periodic catch-up for any messages missed by the streaming subscription.",
      "acceptance_criteria": [
        "AC-002",
        "AC-003"
      ],
      "scope": {
        "includes": [
          "Create getKind1059Filters method",
          "Modify pollMessages to query both kind 4 and kind 1059",
          "Ensure polling interval applies to both kinds",
          "Maintain existing kind 4 polling behavior"
        ],
        "excludes": [
          "Subscription window changes",
          "Polling interval modification",
          "UI changes",
          "Changes to event processing after retrieval"
        ]
      },
      "complexity": "low",
      "mock_dependencies": [],
      "introduces_mocks": [],
      "test_fixtures": [],
      "status": "done",
      "notes": "Independent of story 01. Provides redundant delivery path even if subscription misses events. Can be tested by artificially delaying subscription and verifying polling catches up. Since both stories provide delivery paths, they can be implemented in any order."
    },
    {
      "id": "03",
      "name": "dual-instance-verification",
      "title": "Verify fix with dual-instance test protocol",
      "description": "Execute comprehensive verification using the dual-instance test environment per CLAUDE.md protocol. This includes manual testing with Playwright MCP instrumentation and automated e2e test suite execution. Start two fresh Nostling instances connected to local strfry relay, send 10 messages bidirectionally (20 total), verify 100% delivery rate via UI screenshots and log analysis. Query relay directly to confirm events exist with randomized timestamps spanning the full NIP-17 range (including >24h in past). Verify zero log gaps (all relay events have corresponding 'Received NIP-17 DM' entries). Execute `npm run test:e2e:docker` to confirm no regressions in existing functionality.",
      "acceptance_criteria": [
        "AC-001",
        "AC-002",
        "AC-003",
        "AC-004"
      ],
      "scope": {
        "includes": [
          "Clear data directories and start fresh dual-instance environment",
          "Create identities and mutual contacts",
          "Send 20 messages bidirectionally using Playwright MCP",
          "Take screenshots showing received messages in both UIs",
          "Analyze logs for 'Received NIP-17 DM' entries (expect 10 per instance)",
          "Query relay directly to confirm all events exist",
          "Verify created_at timestamps span full NIP-17 range",
          "Run automated e2e test suite",
          "Document results and confirm all ACs satisfied"
        ],
        "excludes": [
          "Code implementation",
          "Performance testing",
          "Load testing",
          "Security testing beyond functional verification"
        ]
      },
      "complexity": "medium",
      "mock_dependencies": [],
      "introduces_mocks": [],
      "test_fixtures": [
        {
          "fixture_id": "FIXTURE-03-001",
          "description": "Local strfry relay for dual-instance testing",
          "interface": "ws://localhost:8080",
          "reason": "Permanent test infrastructure for verifying message delivery in controlled environment",
          "permanent": true
        },
        {
          "fixture_id": "FIXTURE-03-002",
          "description": "Two separate Electron instances with isolated data directories",
          "interface": "/tmp/nostling-a and /tmp/nostling-b",
          "reason": "Permanent test infrastructure for simulating real-world multi-user scenarios",
          "permanent": true
        }
      ],
      "status": "pending",
      "notes": "This story is the verification phase and should be executed after stories 01 and 02 are implemented. It validates that the combined fix achieves all acceptance criteria. Can be started while code changes are in progress to set up test environment, but final verification requires completed implementation."
    }
  ],
  "story_order": [
    "01",
    "02",
    "03"
  ],
  "dependency_notes": "Stories 01 and 02 are completely independent and can be implemented in parallel or in any order. Both provide delivery improvements: 01 fixes the primary delivery path (streaming subscription), 02 adds redundancy (polling backup). Story 03 depends on completion of 01 and 02, as it verifies the integrated solution. However, story 03 setup activities (environment preparation, test fixture configuration) can begin immediately and run in parallel with implementation.",
  "mock_resolution_plan": "No temporary mocks are introduced in this epic. The stories use only permanent test fixtures (local relay, dual Electron instances) which are part of the standard testing infrastructure per CLAUDE.md. All components being modified (subscription logic, polling logic) are existing production code with no dependencies on unimplemented features.",
  "completed_stories": [
    "02"
  ],
  "current_story": "03"
}
